Output from `terraform plan`
```
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Truncate Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "sentence"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Truncate Data"                                        = {
                      - Next       = "Start DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "sentence"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "sentence"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-nomis-sentence-preproduction"
        name          = "dpr-reload-pipeline-nomis-sentence-preproduction"
        tags          = {
            "Domain"         = "sentence"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.reload-pipeline["visits"].module.reload_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be updated in-place
  ~ resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      ~ definition    = jsonencode(
            {
              - Comment = "Reload Pipeline Step Function"
              - StartAt = "Stop Glue Streaming Job"
              - States  = {
                  - "Archive Raw Data"                                     = {
                      - Next       = "Resume DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.allowed.s3.file.extensions"        = ".parquet"
                              - "--dpr.config.key"                        = "visits"
                              - "--dpr.file.transfer.delete.copied.files" = "true"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-raw-archive-preproduction"
                              - "--dpr.file.transfer.retention.days"      = "0"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-raw-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Copy Data to Temp-Reload Bucket"                      = {
                      - Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                        = "visits"
                              - "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              - "--dpr.file.transfer.delete.copied.files" = "false"
                              - "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              - "--dpr.file.transfer.retention.days"      = "0"
                              - "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Empty Temp Reload Bucket Data"                        = {
                      - End        = true
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "visits"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Invoke DMS State Control Lambda"                      = {
                      - Next           = "Start Glue Batch Job"
                      - Parameters     = {
                          - FunctionName = "dpr-pipeline-notification-function"
                          - Payload      = {
                              - replicationTaskArn = "arn:aws:dms:eu-west-2:972272129531:task:PJJSOVAOQETHSOYUMSCPY5UX5TLQPFDA2NOBQNI"
                              - "token.$"          = "$$.Task.Token"
                            }
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke.waitForTaskToken"
                      - Retry          = [
                          - {
                              - BackoffRate     = 2
                              - ErrorEquals     = [
                                  - "Lambda.ServiceException",
                                  - "Lambda.AWSLambdaException",
                                  - "Lambda.SdkClientException",
                                  - "Lambda.TooManyRequestsException",
                                ]
                              - IntervalSeconds = 60
                              - MaxAttempts     = 2
                            },
                        ]
                      - TimeoutSeconds = 86400
                      - Type           = "Task"
                    }
                  - "Prepare Temp Reload Bucket Data"                      = {
                      - Next       = "Copy Data to Temp-Reload Bucket"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "visits"
                              - "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Resume DMS Replication Task"                          = {
                      - Next       = "Start Glue Streaming Job"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:PJJSOVAOQETHSOYUMSCPY5UX5TLQPFDA2NOBQNI"
                          - StartReplicationTaskType = "resume-processing"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start DMS Replication Task"                           = {
                      - Next       = "Invoke DMS State Control Lambda"
                      - Parameters = {
                          - ReplicationTaskArn       = "arn:aws:dms:eu-west-2:972272129531:task:PJJSOVAOQETHSOYUMSCPY5UX5TLQPFDA2NOBQNI"
                          - StartReplicationTaskType = "reload-target"
                        }
                      - Resource   = "arn:aws:states:::aws-sdk:databasemigration:startReplicationTask"
                      - Type       = "Task"
                    }
                  - "Start Glue Batch Job"                                 = {
                      - Next       = "Archive Raw Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "visits"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-batch-visits-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Start Glue Streaming Job"                             = {
                      - Next       = "Switch Hive Tables for Prisons to Curated"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "visits"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-reporting-hub-cdc-visits-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun"
                      - Type       = "Task"
                    }
                  - "Stop Glue Streaming Job"                              = {
                      - Next       = "Update Hive Tables"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-visits-preproduction"
                            }
                          - JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Curated"            = {
                      - Next       = "Empty Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "visits"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      - Next       = "Truncate Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"                         = "visits"
                              - "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          - JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Truncate Data"                                        = {
                      - Next       = "Start DMS Replication Task"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"            = "visits"
                              - "--dpr.file.deletion.buckets" = "dpr-raw-zone-preproduction,dpr-raw-archive-preproduction,dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          - JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                  - "Update Hive Tables"                                   = {
                      - Next       = "Prepare Temp Reload Bucket Data"
                      - Parameters = {
                          - Arguments = {
                              - "--dpr.config.key"       = "visits"
                              - "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          - JobName   = "dpr-hive-table-creation-preproduction"
                        }
                      - Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      - Type       = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id            = "arn:aws:states:eu-west-2:972272129531:stateMachine:dpr-reload-pipeline-nomis-visits-preproduction"
        name          = "dpr-reload-pipeline-nomis-visits-preproduction"
        tags          = {
            "Domain"         = "visits"
            "Jira"           = "main"
            "Resource_Type"  = "Step Function"
            "Service_Bundle" = "true"
        }
        # (8 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_iam_policy.step_function_execution[0] will be created
  + resource "aws_iam_policy" "step_function_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-replay-pipeline-nomis-prisoner-ed-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:UpdateLogDelivery",
                          + "logs:PutResourcePolicy",
                          + "logs:ListLogDeliveries",
                          + "logs:GetLogDelivery",
                          + "logs:DescribeResourcePolicies",
                          + "logs:DescribeLogGroups",
                          + "logs:DeleteLogDelivery",
                          + "logs:CreateLogDelivery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "xray:PutTraceSegments",
                          + "xray:PutTelemetryRecords",
                          + "xray:GetSamplingTargets",
                          + "xray:GetSamplingRules",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_iam_role.step_function_role[0] will be created
  + resource "aws_iam_role" "step_function_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-replay-pipeline-nomis-prisoner-ed-preproduction-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_invoke_lambda_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_iam_role_policy_attachment.step_function_role_policy_attachment["arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "step_function_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_start_glue_job_policy"
      + role       = (known after apply)
    }

  # module.replay-pipeline["prisoner-ed"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = jsonencode(
            {
              + Comment = "Replay Pipeline Step Function"
              + StartAt = "Stop Glue Streaming Job"
              + States  = {
                  + "Copy Data to Temp-Reload Bucket"                      = {
                      + Next       = "Switch Hive Tables for Prisons to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner-ed"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "false"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-temp-reload-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Empty Temp Reload Bucket Data"                        = {
                      + End        = true
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-ed"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Move Archived Data Back to Raw Bucket"                = {
                      + Next       = "Start Glue Batch Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                        = "prisoner-ed"
                              + "--dpr.config.s3.bucket"                  = "dpr-glue-jobs-preproduction"
                              + "--dpr.file.transfer.delete.copied.files" = "true"
                              + "--dpr.file.transfer.destination.bucket"  = "dpr-raw-zone-preproduction"
                              + "--dpr.file.transfer.retention.days"      = "0"
                              + "--dpr.file.transfer.source.bucket"       = "dpr-raw-archive-preproduction"
                            }
                          + JobName   = "dpr-s3-file-transfer-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Prepare Temp Reload Bucket Data"                      = {
                      + Next       = "Copy Data to Temp-Reload Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-ed"
                              + "--dpr.file.deletion.buckets" = "dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Batch Job"                                 = {
                      + Next       = "Switch Hive Tables for Prisons to Curated"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"       = "prisoner-ed"
                              + "--dpr.config.s3.bucket" = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-batch-prisoner-ed-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Start Glue Streaming Job"                             = {
                      + Next       = "Empty Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.clean.cdc.checkpoint" = "true"
                              + "--dpr.config.key"           = "prisoner-ed"
                              + "--dpr.config.s3.bucket"     = "dpr-glue-jobs-preproduction"
                            }
                          + JobName   = "dpr-reporting-hub-cdc-prisoner-ed-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun"
                      + Type       = "Task"
                    }
                  + "Stop Glue Streaming Job"                              = {
                      + Next       = "Prepare Temp Reload Bucket Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.stop.glue.instance.job.name" = "dpr-reporting-hub-cdc-prisoner-ed-preproduction"
                            }
                          + JobName   = "dpr-stop-glue-instance-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Curated"            = {
                      + Next       = "Start Glue Streaming Job"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-ed"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Switch Hive Tables for Prisons to Temp-Reload Bucket" = {
                      + Next       = "Truncate Data"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"                         = "prisoner-ed"
                              + "--dpr.prisons.data.switch.target.s3.path" = "s3://dpr-temp-reload-preproduction"
                            }
                          + JobName   = "dpr-switch-prisons-hive-data-location-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                  + "Truncate Data"                                        = {
                      + Next       = "Move Archived Data Back to Raw Bucket"
                      + Parameters = {
                          + Arguments = {
                              + "--dpr.config.key"            = "prisoner-ed"
                              + "--dpr.file.deletion.buckets" = "dpr-structured-zone-preproduction,dpr-curated-zone-preproduction"
                            }
                          + JobName   = "dpr-s3-data-deletion-job-preproduction"
                        }
                      + Resource   = "arn:aws:states:::glue:startJobRun.sync"
                      + Type       = "Task"
                    }
                }
            }
        )
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-nomis-prisoner-ed-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "prisoner-ed"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "prisoner-ed"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_dms_endpoint" "dms-s3-target-source" {
      - database_name               = (sensitive value) -> null
      - endpoint_arn                = "arn:aws:dms:eu-west-2:972272129531:endpoint:ESSDOEFXJ5ZPU2JTXXYYCSEIG2WV2XIRJA4ZCSY" -> null
      - endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint" -> null
      - endpoint_type               = "source" -> null
      - engine_name                 = "oracle" -> null
      - extra_connection_attributes = "supportResetlog=TRUE" -> null
      - id                          = "dpr-dms-nomis-oracle-source-endpoint" -> null
      - kms_key_arn                 = "arn:aws:kms:eu-west-2:972272129531:key/230cd1dc-21a5-459a-bd70-e1470e635848" -> null
      - password                    = (sensitive value) -> null
      - port                        = (sensitive value) -> null
      - server_name                 = (sensitive value) -> null
      - ssl_mode                    = "none" -> null
      - tags                        = {
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Source Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                    = {
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Source Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - username                    = (sensitive value) -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      - add_column_name                             = false -> null
      - add_trailing_padding_character              = false -> null
      - bucket_name                                 = "dpr-raw-zone-preproduction" -> null
      - cdc_inserts_and_updates                     = true -> null
      - cdc_inserts_only                            = false -> null
      - cdc_max_batch_interval                      = 10 -> null
      - cdc_min_file_size                           = 0 -> null
      - cdc_path                                    = "cdc" -> null
      - compression_type                            = "NONE" -> null
      - csv_delimiter                               = "," -> null
      - csv_row_delimiter                           = "\\n" -> null
      - data_format                                 = "parquet" -> null
      - data_page_size                              = 0 -> null
      - date_partition_enabled                      = false -> null
      - dict_page_size_limit                        = 0 -> null
      - enable_statistics                           = true -> null
      - endpoint_arn                                = "arn:aws:dms:eu-west-2:972272129531:endpoint:BG457LWCVGZUJ5YZUEB2UZRG7MSW5VHWEH3C7HY" -> null
      - endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint" -> null
      - endpoint_type                               = "target" -> null
      - engine_display_name                         = "Amazon S3" -> null
      - glue_catalog_generation                     = false -> null
      - id                                          = "dpr-dms-nomis-s3-target-endpoint" -> null
      - ignore_header_rows                          = 0 -> null
      - include_op_for_full_load                    = true -> null
      - max_file_size                               = 120000 -> null
      - parquet_timestamp_in_millisecond            = false -> null
      - preserve_transactions                       = false -> null
      - rfc_4180                                    = true -> null
      - row_group_length                            = 0 -> null
      - service_access_role_arn                     = "arn:aws:iam::972272129531:role/dpr-dms-nomis-s3-endpoint-role" -> null
      - ssl_mode                                    = "none" -> null
      - status                                      = "active" -> null
      - tags                                        = {
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Target Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - tags_all                                    = {
          - "Domain"         = "Common"
          - "Jira"           = "main"
          - "Resource_Type"  = "DMS Target Endpoint"
          - "Service_Bundle" = "true"
        } -> null
      - timestamp_column_name                       = "_timestamp" -> null
      - use_csv_no_sup_value                        = false -> null
      - use_task_start_time_for_full_load_timestamp = false -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_iam_policy" "dms-operator-s3-policy" {
      - arn       = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy" -> null
      - id        = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy" -> null
      - name      = "dpr-dms-nomis-operator-s3-target-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "kms:*",
                          - "cloudwatch:*",
                          - "ec2:CreateNetworkInterface",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeVpcs",
                          - "ec2:DeleteNetworkInterface",
                          - "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "s3:*Object*",
                          - "s3:PutObjectTagging",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3::*:dpr-*/*",
                          - "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:ListAccessPoints",
                          - "s3:ListJobs",
                          - "s3:ListObjects",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA6EX7PKX5U7LNSY3WD" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_iam_policy" "dms-s3-target-policy" {
      - arn       = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy" -> null
      - id        = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy" -> null
      - name      = "dpr-dms-nomis-s3-target-policy" -> null
      - path      = "/" -> null
      - policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:*",
                          - "kms:*",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id = "ANPA6EX7PKX5VB6I6QVHR" -> null
      - tags      = {} -> null
      - tags_all  = {} -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_iam_role" "dms-operator-s3-target-role" {
      - arn                   = "arn:aws:iam::972272129531:role/dpr-dms-nomis-operator-s3-target-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "dms.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-02-06T23:36:38Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-dms-nomis-operator-s3-target-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-dms-nomis-operator-s3-target-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6EX7PKX57O4SH76QO" -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_iam_role" "dms-s3-role" {
      - arn                   = "arn:aws:iam::972272129531:role/dpr-dms-nomis-s3-endpoint-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "dms.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-02-06T23:36:38Z" -> null
      - force_detach_policies = false -> null
      - id                    = "dpr-dms-nomis-s3-endpoint-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "dpr-dms-nomis-s3-endpoint-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROA6EX7PKX5VOPVNOESF" -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      - id         = "dpr-dms-nomis-operator-s3-target-role-20240206233639308500000002" -> null
      - policy_arn = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-operator-s3-target-policy" -> null
      - role       = "dpr-dms-nomis-operator-s3-target-role" -> null
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be destroyed
  # (because module.setup-dms-endpoints.module.dms_endpoints is not in configuration)
  - resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      - id         = "dpr-dms-nomis-s3-endpoint-role-20240206233639272000000001" -> null
      - policy_arn = "arn:aws:iam::972272129531:policy/dpr-dms-nomis-s3-target-policy" -> null
      - role       = "dpr-dms-nomis-s3-endpoint-role" -> null
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "oracle"
      + extra_connection_attributes = "supportResetlog=TRUE"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = 1521
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "nomis"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-operator-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["prisoner"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-s3-endpoint-role"
    }

Plan: 67 to add, 67 to change, 24 to destroy.

```